{"initiativeID":0,"initiativeDesc":"","initiativeText":"In this context, the term \"initiative\" refers to a statement of high-level objectives with a unifying theme. An initiative will spawn a number of projects, with each project addressing one or more objectives of the initiative in detail.\\n\\n    Normally, initiatives are a natural product of the formal process of strategic planning. In the case of Technology Initiatives, their definition depends upon a flow-down of objectives from the Office of Technology Strategic Plan, which in turn depends upon a flow-down of objectives from the Institute Strategic Plan.\\n\\n    Such a formal hierarchy of objectives for the Institute and Office of Technology has not yet been created. Strategic planning at the Institute and Office of Technology is expected to be completed for 2004. In the meantime, the CIO will maintain a set of Technology Initiatives that, while independent of a formal flow-down of objectives, are clearly critical to the ongoing success of the Institute. "}
{"initiativeID":1,"initiativeDesc":"Institute Architecture Planning","initiativeText":"This initiative encompasses all activities to improve our understanding of the Institute's business and technical infrastructures, architecting an infrastructure for the future, and planning projects for achieving it. Initial projects related to this initiative include completing the rollout of the technology governance structure, incorporating the technology values and principles into division's strategic planning processes and documenting our current infrastructures in the State of Technology report."}
{"initiativeID":2,"initiativeDesc":"Information Management and Process Planning","initiativeText":"Many of our current and future challenges in information management dictate that we pay close attention to the information management schemes we embed in our software systems and business processes. This initiative encompasses projects that transform the processes and technologies of information management."}
{"initiativeID":3,"initiativeDesc":"Infrastructure","initiativeText":"This initiative encompasses projects to augment the capacity and reliability of our current business, mission and scientific technology infrastructure, including IT security challenges."}
{"initiativeID":4,"initiativeDesc":"Software and Systems Lifecycle Management","initiativeText":"The OT Systems and Software Engineering Officer will be working closely with the CIO to address the challenges of software and systems lifecycle management. This initiative focuses on the development, and implementation of STScI-wide approaches to systems development and life-cycle management."}
{"initiativeID":5,"initiativeDesc":"Optimize with Technology","initiativeText":"Adapt or die.....the Institute must always strive to optimize and improve in many areas. In FY2004, we will focus on using technologies to improve communications between missions, divisions and individuals such as scheduling events, calendaring, remote collaborations and visibility into various business and program management functions."}
