{"maturityID":0,"maturityDesc":"","maturityText":""}
{"maturityID":1,"maturityDesc":"idea","maturityText":"This is the primordial state of all projects. An idea describes a current problem and/or an alternative future. Ideas need to be fleshed out and vetted before they become visible in the portfolio.  That is, ideas are not visible in the tool unless you explicitly ask for them.\\n\\n    Required Metadata: Proposer, Project Name, Description, Rationale."}
{"maturityID":2,"maturityDesc":"scoping","maturityText":"Work toward promotion to concept has been approved.  This work requires developing a brief description of what the project would involve, and a rationale describing why this would be beneficial to the Institute. The rationale explains the links between the work and STScI strategic goals, deliverables in support of the Missions (HST, JWST, CMO, OPO) or Division level strategies and goals.  At a minimum, the original sponsor or customer need to clarify the rationale; the hosting organization (e.g., CPT or ESS) needs to describe what the project would involve. For many ideas this scoping activity can take place at TC meetings. If necessary, additional business or technical experts can be invited to these meetings. For more complex ideas, a TC member can be assigned to coordinate the scoping effort."}
{"maturityID":3,"maturityDesc":"concept","maturityText":"The original idea has been documented in sufficient detail that the project could remain in this state without key ideas being forgotten.  This is the stage where synergies and shared interests between similar or related concepts and proposals will become apparent, stakeholders can be identified, and stakeholders can negotiate concepts to maximize the overall benefit to the Institute.\\n\\n    Required Metadata: Idea + Customer, Stakeholders, Host, Technology, Strategies, Initiative, Project Type, Drivers, Portfolio Category"}
{"maturityID":4,"maturityDesc":"business case","maturityText":"Work to develop a business case has been approved.  The CIO decides how much detail is required, and the customer and hosting division are responsible for developing it.  A business case compares the costs (labor, non-labor, opportunity) of doing the work with the potential benefits, and the risk of not doing, the work to show a return on investments. For projects that require significant investments, the funding source(s) and type(s) must also be identified at this stage."}
{"maturityID":5,"maturityDesc":"proposal","maturityText":"The original idea has now been defined in sufficient detail that it can be considered for implementation in the current or next cycle. At this stage it is still a proposed project, since there is no guarantee that we have the resources to implement it.\\n\\n    Required Metadata: Concept + Risk levels, Sponsor, Funding type, Portfolio Category"}
{"maturityID":6,"maturityDesc":"project","maturityText":"The proposal has been committed to an implementation plan, and has been handed off to its host division for execution as a project."}
