{"strategyID":1,"strategyDesc":"_(2002 goal) Operate STScI","strategyText":"We recognize the importance of supporting and advancing all our missions - HST, NGST, the Archive, our Outreach programs - to enable our vision.  We will continue to work with the community to investigate and advocate new missions, to enable forefront scientific advances and continue to change humankind's view of its place in the universe."}
{"strategyID":2,"strategyDesc":"_(2002 goal) Optimize scientific return of HST","strategyText":"Hubble is our first telescope. In 1990, it launched a new era of astronomical research from space with unprecedented capability, data quality, and data volume. We will optimize the science program of Hubble's second ten years and continue to serve the community in its best scientific use of the facility."}
{"strategyID":3,"strategyDesc":"_(2002 goal) Be among top research institutions","strategyText":"Our excellent astronomy and support staff has made us a first rank research institute. We will continue to attract excellent scientists and provide them with an academic environment that nourishes superlative research."}
{"strategyID":4,"strategyDesc":"_(2002 goal) Plan for JWST","strategyText":"JWST will be our second major telescope. Starting in this next decade, it will explore the universe at infrared wavelengths. We will help develop-then operate-the best JWST possible, with full inheritance of Hubble lessons-learned and full engagement of the community in its development."}
{"strategyID":5,"strategyDesc":"_(2002 goal) Run a world-class data archive","strategyText":"Our archive has become a first-rank research facility in its own right, providing unique research and outreach opportunities. We will continue to run the best astronomical data archive in the world, adding new data sets, providing new research tools, and collaborating with other data centers to provide an international astronomy data system."}
{"strategyID":6,"strategyDesc":"_(2002 goal) Improve and extend outreach","strategyText":"Our education and public outreach programs have engaged the public and made Hubble a household word. We will improve these programs, extend them to NGST and make them available to the rest of astronomy, assuring maximum benefit from the research enterprise to the public."}
{"strategyID":7,"strategyDesc":"_(2002 goal) Technology transfer","strategyText":"Our new technologies to improve Hubble operations have been applied beyond astronomy; we expect this trend to continue, increasing the benefit to society as a whole.  We will continue to facilitate the transfer of our technical innovations to other fields of research and to the private sector."}
{"strategyID":8,"strategyDesc":"_(2002 goal) State-of-the-art technical staff","strategyText":"Our approaches and solutions to technical, operational and procedural challenges have changed the way astronomy is done and have been adopted by observatories worldwide.  We will continue to attract the best technical staff to advance and apply the state of the art for astronomy."}
{"strategyID":100,"strategyDesc":"Business Base","strategyText":"I. Business base (retention, enhancement, or acquisition of missions that support substantial fractions of the Institute’s workforce.)"}
{"strategyID":110,"strategyDesc":"Business Base:HST","strategyText":"I.1. Maintain HST as the world’s leading observatory at least until JWST operations begin."}
{"strategyID":120,"strategyDesc":"Business Base:HST:Advocate Servicing","strategyText":"I.1.a. Advocate for Hubble servicing as supported by NASA and the NRC (Lanzerotti report)."}
{"strategyID":130,"strategyDesc":"Business Base:HST:Extend Lifetime","strategyText":"I.1.b. Enhance the scientific impact of HST by extending its operational lifetime."}
{"strategyID":140,"strategyDesc":"Business Base:HST:Create Rebid Proposal","strategyText":"I.1.c. Create AURA proposal for next HST contract."}
{"strategyID":150,"strategyDesc":"Business Base:JWST","strategyText":"I.2. Ensure that JWST meets its science goals."}
{"strategyID":160,"strategyDesc":"Business Base:JWST:Operations Systems","strategyText":"I.2.a. Develop JWST operations systems that ensure productive use of the observatory for its science goals."}
{"strategyID":170,"strategyDesc":"Business Base:JWST:Build Public Support","strategyText":"I.2.b. Build public support for JWST through coordinated approaches to the community, NASA, &amp; the public."}
{"strategyID":180,"strategyDesc":"Business Base:Next UVOIR","strategyText":"I.3. Compete to be the S&amp;OC for the next major UVOIR mission(s)."}
{"strategyID":190,"strategyDesc":"Business Base:Next UVOIR:TPF-C Mission Def","strategyText":"I.3.a. Work with NASA on TPF-C mission definition."}
{"strategyID":200,"strategyDesc":"Business Base:Next UVOIR:TPF-C S&amp;OC","strategyText":"I.3.b. Create proposal team and support to bid for the TPF-C S&amp;OC."}
{"strategyID":210,"strategyDesc":"Business Base:Next UVOIR:Other Mission Defs","strategyText":"I.3.c. Work with NASA and the community on definition of other (than TPF-C) large UVOIR missions."}
{"strategyID":220,"strategyDesc":"Business Base:OPO","strategyText":"I.4. Make OPO a national center for education and outreach in astronomy."}
{"strategyID":230,"strategyDesc":"Business Base:OPO:HST at Forefront","strategyText":"I.4.a. Keep HST at the forefront of astronomy in the public mind."}
{"strategyID":240,"strategyDesc":"Business Base:OPO:Broaden Reach","strategyText":"I.4.b. Expand the cross-section of the American public that we reach."}
{"strategyID":250,"strategyDesc":"Business Base:OPO:Support Teaching","strategyText":"I.4.c. Provide resources and tools across multiple NASA missions to support teaching of science, technology, engineering, and mathematics."}
{"strategyID":260,"strategyDesc":"Competitiveness","strategyText":"II. Competitiveness (ways we carry out our work or acquisition of special work that improves the likelihood of enhancing our business base)."}
{"strategyID":270,"strategyDesc":"Competitiveness:Costs","strategyText":"II.1. Decrease costs at STScI while preserving the scientific and technical excellence that gives us a competitive advantage for mission support."}
{"strategyID":280,"strategyDesc":"Competitiveness:Costs:Process Improvement","strategyText":"II.1.a. Improve STScI processes to comply with all major mission performance, cost, &amp; schedule requirements."}
{"strategyID":290,"strategyDesc":"Competitiveness:Costs:Full Cost Evaluations","strategyText":"II.1.b. Use full cost evaluations of our work to guide strategic choices of the systems and services we will support and the evolution of those systems and services."}
{"strategyID":300,"strategyDesc":"Competitiveness:Costs:Optimize Across Missions","strategyText":"II.1.c. Coordinate HST and JWST best practices and investments to optimize work across both missions."}
{"strategyID":310,"strategyDesc":"Competitiveness:Community","strategyText":"II.2. Support community-led astronomy programs that enhance our core competencies &amp; contributions."}
{"strategyID":320,"strategyDesc":"Competitiveness:Community:NVO Leadership","strategyText":"II.2.a.  Make STScI a leader of the NVO operational facility."}
{"strategyID":330,"strategyDesc":"Competitiveness:Community:Small Mission Costs","strategyText":"II.2.b. Reduce costs for small mission support by leveraging our expertise and infrastructure."}
{"strategyID":340,"strategyDesc":"Competitiveness:Community:Partnerships","strategyText":"II.2.c. Seek partnerships on community projects that focus on key scientific and technological areas relevant to large astronomy programs."}
