{"technologyID":0,"technologyDesc":"none","technologyText":"","technologyRationale":""}
{"technologyID":1,"technologyDesc":"1. Security","technologyText":"The current security model for the Institute is primarily host based (i.e., defending each host independently), with additional layers of security provided by a firewall and filtering routers.  The internal network is defended by prohibiting connections from untrusted machines (like personal laptops).\\n\\n    Users have multiple accounts, basically one for each operating system and service.  A number of services use LDAP for authentication, but in general, a user will have many independent authentication records.  There is a password policy.","technologyRationale":"Implementing the requirements of NASA Procedures and Guidelines (NPG) 2810 is a key contractual obligation, as well as a way of mitigating risk.  Process improvements that automate those procedures have a significant potential for labor savings.  Applying security patches is now a labor-intensive procedure.  A virtual private network (VPN) can provide secure off-site access to critical information, which would otherwise be impossible or require labor-intensive access control configuration.\\n\\n    Implementing IT security is a CPT responsibility."}
{"technologyID":2,"technologyDesc":"2. Network","technologyText":"The Network Infrastructure encompasses all hardware, software and services required to provide communication paths between internal and external IT equipment. Hardware includes the cabling plant, routers, swThe Network Infrastructure encompasses all hardware, software and services required to provide communication paths between internal and external IT equipment. Hardware includes the cabling plant, routers, switches, wireless stations and servers. Software includes the various services, and network traffic and security monitoring and management tools. Services include DNS, DHCP, RADIUS and Dialup modem access.\\n\\n    STScI’s network is based on a Gigabit backbone that serves the two main locations: Muller and Bloomberg. Our connection to the Internet is provided through GSFC and NISN. The Institute has a dedicated OC12/OC3 connection over AT&T’s SONET to GSFC, which supports both the HST data connections and the connections to and from the Internet at large. For our connection to the Internet, GSFC provides us with a 26Mbit connection through NISN. The Network provides internal and external users and processes access to information,  compute resources and services. External access to our network is essential to our contractual obligation to provide HST and MAST data products, public outreach content, and other information to the astronomical community and the public at large.","technologyRationale":"The Network provides internal and external users and processes access to information and compute resources and services. External access to our network is essential to our contractual obligation to provide HST and MAST data products, public outreach content, and other information to the astronomical community and the public at large.  The Network is also crucial to our staff in the performance of its duties, and any network outage results in lost productivity.  So the entire Institute, at least, is a stakeholder in the maintenance of the network.\\n\\n    Demand for network bandwidth increases with time; it is important to monitor network activity and to main a safety margin of available bandwidth.  Continuous, incremental increases in network performance and reliability generally have a lower overall cost than painful, dramatic upgrades.  Leveraging our network infrastructure to support new services, such as wireless or Voice-over-IP (VoIP) telephony, has a potential for labor and cost savings."}
{"technologyID":3,"technologyDesc":"3. Science Computing","technologyText":"Science computing supports independent scientific research by staff members.  This is distinct from the computing for functional science that supports the missions, described separately under the heading Mission Systems.  Science computing covers a broad range problems, from those that fit easily within the capability of a functional desktop to those just on the edge of being technically feasible.  It covers a range of collaboration from that of an individual researcher, with perhaps a student or off-site collaborators, to large groups (e.g., GOODS) that need to process, share, and visualize huge amounts of data.  It covers a range of activity from writing proposals to writing papers, along with everything in between, like analysis, software development, budgets, etc.  On the other hand, science computing may not have the rigorous (and expensive) uptime and configuration control requirements of the production environment of the mission systems.","technologyRationale":"One of the Institute strategic business drivers is the desire that the Institute be among the top research institutions.  Establishing an IT environment to support the computing needs of cutting edge scientific research is one response to this desire."}
{"technologyID":4,"technologyDesc":"4. Business Systems","technologyText":"Business Systems are employed by the Business Resources Center (BRC) and Program Management staff to support STScI business functions such as:  accounting, budgets, contracts, facilities management, finance, grants administration, human resources, procurement, property administration, publications, travel support, and the tracking and reporting of contractual requirements.","technologyRationale":"Business systems must conform to best practices and contractual requirements, operate effectively, and be kept up to supported versions and recent technologies.  Business information needs to be shared to avoid duplication and inconsistency, and to enable Institute staff and customers.  As such, the Institute as a whole is a stakeholder in the success of projects that support the business systems infrastructure."}
{"technologyID":5,"technologyDesc":"5. Mission Systems","technologyText":"Supporting the operation of the HST mission and planning for the JWST mission are two key Institute functions.  The ability to support and plan for multiple missions (e.g., FUSE, GALEX, Kepler) is a key Institute strategy.  Many of our contractual obligations are associated with mission support, especially the HST mission.  There is IT infrastructure critical to fulfilling these obligations, and managing the risk associated with that infrastructure has a high priority.  There is also a high cost associated with this infrastructure, and cost reductions are also a high priority.\\n\\n    The Planning and Scheduling system supports development, testing, and operations of HST observing.  This includes proposal solicitation and selection, command development and command load generation, mission planning and scheduling, servicing mission support, safe mode re-planning, and target of opportunity observations.\\n\\n    The Data Management Systems (DMS) process the science and engineering data from HST and other missions, store data and derived metadata, and support data retrieval and distribution to observers and the community at large. The current operational environment is dominated by a Solaris Sunfire 15K and an EMC storage device, and includes a mix of Solaris and Windows systems.  The live Archive is stored on the EMC (“Data Depot”) and backed up on MO platter jukeboxes. Duplicate platters are kept in a physically separate location for permanent storage. HST data are also replicated to the ST-ECF in Germany and the CADC in Canada.  For every system in the operational environment, there is a comparable system in the development environment, which is also used for unit testing and very limited integration testing.  An <a href=\"http://www.stsci.edu/institute/center/docs/sunFire15kOCD.pdf\">\\n    Operations Concept Document</a> describes the governance of the DMS.","technologyRationale":"The data management systems are critical to ingest and processing of HST data, and in providing the astronomical community with access to their observations and to the MAST Archive as a whole.  These projects protect our investment in those systems by making sure that changes are made in a carefully controlled and tested manner."}
{"technologyID":17,"technologyDesc":"8.i. Help Desk","technologyText":"The Remedy Help Desk system supports many functions within the Institute (HST observer support, computer support, and public outreach) by providing a system for categorizing and tracking support requests, especially those in the form of e-mail messages.","technologyRationale":"Evolving the Remedy Help Desk support is driven by routine maintenance and cost reduction needs."}
{"technologyID":18,"technologyDesc":"8.j. FTP","technologyText":"The institute maintains a centralized FTP server for general use, and a server optimized for the distribution of data from MAST.","technologyRationale":"MAST is faced with increased demand for the transfer of large proprietary data sets, and needs an FTP server with the flexibility to handle these special requirements."}
{"technologyID":6,"technologyDesc":"6. Staff Computing","technologyText":"The computer environment that most STScI staff members encounter every day consists largely of desktop workstations, laptops, and centralized file servers.  Users at their desks need access to all of the resources required to perform their jobs.  Some users need access to some resources when they are away from their desks, while for others this access is at least a convenience.  In the past, our response to this matrix of different kinds of users with different kinds of requirements and varying levels of mobility has been a proliferation of solutions.  Many users have more than one system, often side-by-side on the same desktop.  The number of choices complicates procurement, maintenance, and support, which leads to cost and to risk.\\n\\n    In addition, CPT provides some (low) level of services for users with platforms other than those CPT supports.  Network access, hardware support, and software support for personal mobile and wireless computers of staff and visitors are commonly requested services.","technologyRationale":"Our staff computer environment has suffered from a piecemeal approach to parts of the solution space, especially from a platform (operating-system) specific approach to solutions.  One project here would develop a a strategy for a holistic approach, driven by the need to reduce the cost of procurement and support for these systems.  The other projects address needs that are too urgent to wait for the strategy project to finish."}
{"technologyID":7,"technologyDesc":"7. IT Administration","technologyText":"IT Administration consists of the set of methodologies, processes, and techniques that the Center for Process and Technology employs to provide IT support and services to all areas and missions of STScI.","technologyRationale":"We don’t always like to acknowledge it, but it costs something to use technology to do our jobs. One of the most basic costs for STScI is the overhead of administering our IT environment.  These projects are intended to derive the most benefit from these costs."}
{"technologyID":9,"technologyDesc":"8.a. E-mail","technologyText":"Electronic mail is a mainstay of communications among STScI staff and the astronomical community. Tens of thousands of messages, and hundreds of megabytes of content are sent and received every business day.  Almost all e-mail traffic is handled by Mirapoint appliances. Staff access to e-mail is provided by platform-dependent clients and web browsers.  Mailing lists are handled in Majordomo, outside of the Mirapoint appliances.","technologyRationale":"Communication is a requirement for STScI staff to carry out their functional and scientific tasks. It is imperative that the e-mail service be robust, responsive, and highly available.  It is desirable to reduce the impact of unsolicited commercial e-mail (spam)."}
{"technologyID":10,"technologyDesc":"8.b. Web","technologyText":"The Institute’s web content is served by a mix of Apache, Zope, IIS, PHP, and Tomcat servers.  Apache is mainly for serving static content.  It runs under Windows and many flavors of Unix, including Mac OS X. The main web site is an Apache site, but the Institute’s “top level” pages are generated dynamically in Zope and served out by reverse proxy from Apache. IIS is generally reserved for Web applications that must run under Windows. Apache/PHP drives the dynamic web site of the Archive. Tomcat provides web access to APT. Other content is spread out over dozens of Apache/Solaris systems–a historical situation traceable to chronic disk space shortages on the central server. ","technologyRationale":"Information provided by way of the Web is a vital service to the astronomical community, our staff, and the public.  This information is expected to be available at all times, current, easy to navigate, searchable, and under appropriate access control.  Employees expect access to job-related information, even when they are off-site.  The infrastructure required to support this service must be highly available (always up), must be secure against abuse, must have sufficient computing capacity to generate dynamic content, and must allow content providers to control access to their content."}
{"technologyID":11,"technologyDesc":"8.c. Enterprise Directory","technologyText":"The Enterprise Directory is a centralized, authoritative source of staff information.  Data were recently migrated from Remedy to LDAP, and made available for a number of read-only applications, such as e-mail address books. LDAP is used to authenticate users of our central e-mail servers. A web interface is available for divisional administrators to manage basic employee information.  Users can manage some of their own information (password, contact information, photo).","technologyRationale":"A single source for staff information eliminates duplication and inconsistency, and LDAP makes this information more accessible by many applications."}
{"technologyID":12,"technologyDesc":"8.d. Backups","technologyText":"Centrally controlled and routinely scheduled backups occur for a large collection of STScI file servers, data storage areas, and desktop machines. Additionally. STScI staff personally backup data on a variety of media (floppy, Zip, CD, DVD disks, external drives FireWire drives, etc.) ","technologyRationale":"Routine backup of local and central storage guarantees data integrity and provides a low-level of security for data critical to staff activities. With the current resources, it is impossible to backup all data files currently on the STScI network."}
{"technologyID":13,"technologyDesc":"8.e. Streaming","technologyText":"CPT provides routine real-time webcasting services for events in the STScI auditorium and delayed broadcast of events in other locations. An archive of webcasts is maintained. Video conferencing is available in several locations within STScI although responsibilities for maintenance are unclear and JWST has a requirement to communicate with NGST via video conferencing. Desktop conferencing has been installed in various places around STScI without any particular plan or evaluation of the impact on the STScI network. ","technologyRationale":"This technology (webcasting, video/desktop conferencing) expands the spectrum of available communication channels. It provides a way to communicate visually in a geographically distributed manner. In a time of shrinking budgets, it may provide an alternative to travel when ‘face-to-face’ meetings are needed. In this regard, this technology begins to converge with other collaboration technologies being investigated below."}
{"technologyID":14,"technologyDesc":"8.f. Collaboration Tools","technologyText":"The Institute has a centralized service for reserving meeting rooms, and another for reporting staff absences.  Staff have a variety of tools for managing appointments, but there is no comprehensive solution for bringing people and rooms together, sharing calendars, allowing someone else to manage your meetings, and syncing to PDAs. Staff work while traveling and telecommuting; often they need to communicate and collaborate with colleagues off-site. In times of shrinking budgets it needs to be easier to work with colleagues without needing to travel across the country.","technologyRationale":"STScI staff meet and work together. There needs to be an easier and cheaper way to do this."}
{"technologyID":15,"technologyDesc":"8.g. Databases","technologyText":"Data critical to the operation STScI are stored in relational databases on a half dozen Sybase servers, a few Oracle servers, and nearly two dozen Microsoft SQLServer servers.","technologyRationale":"Centralized data storage is a fundamental service that enables data integrity and provides the first level of security to important data used by our customers."}
{"technologyID":16,"technologyDesc":"8.h. Printers","technologyText":"Each year, STScI produces approximately 2 million pages from about 200 printers scattered around the Muller and Bloomberg buildings.  Printers are being used for some jobs that a copier could do more inexpensively.","technologyRationale":"Hardcopy output remains an important means of managing and sharing information and complements increasingly powerful electronic means. To operate STScI we must continue to support public and private printing."}
