{"typeID":1,"typeDesc":"process engineering","typeText":"These are projects that focus on people and systems processes. These may include migration, upgrade, or new functionality type work in an implementation phase (or follow-on project)."}
{"typeID":2,"typeDesc":"maintenance","typeText":"These are \"keep the lights on\" projects. Most maintenance work is not run as projects, however. Maintenance would include items like OS patching, servicing jukebox mechanics, or replacing faulty memory, power supplies, or UPS. Replacing a broken system with an identical replacement without making any significant changes to the infrastructure may be maintenance, but see below under upgrade. Maintenance projects do not add any new systems or functionality to the environment. "}
{"typeID":3,"typeDesc":"migration","typeText":"These are projects that rearrange existing hardware, software or processes, and may consist of re-configuration, consolidation, optimization, porting, or physical relocation.  Examples include consolidating storage on the EMC, or moving the last processing off of VMS. Although they do not necessarily add new things, these projects do change the infrastructure. "}
{"typeID":4,"typeDesc":"new functionality","typeText":"These projects add a new service or capability (e.g., event manager) or new functionality (Covalent), as distinct from upgrades of existing products. These are generally software development or COTS integration and deployment type projects. "}
{"typeID":5,"typeDesc":"strategy","typeText":"Strategy projects produce Institute wide, multi-year strategic technology plans."}
{"typeID":6,"typeDesc":"evaluation","typeText":"These are projects that evaluate new technologies or processes, perform applicability studies, etc. Results may include pilot implementations or white papers. "}
{"typeID":7,"typeDesc":"upgrade","typeText":"Upgrade projects are not limited to system or software upgrades, but also include upgrading or augmenting capacity, reliability, etc., such as adding servers to a farm.  Replacing aging systems may be seen as maintenance, but often these are not one-on-one replacements but involve upgrades or re-engineering the current system to take advantage of new technology and performance. OS upgrades from Solaris 8 to 10, or to Windows XP would likely be handled as a planning or strategy project followed by an upgrade project."}
{"typeID":8,"typeDesc":"planning","typeText":"Planning projects collect information to produce a document that will be used to decide on follow on work. They are tactical in nature."}
{"typeID":9,"typeDesc":"management","typeText":"These are management activity projects that support the delivery of services, such as new maintenance contracts or ISP selection."}
{"typeID":10,"typeDesc":"service","typeText":"These are projects to provide an agreed up on service. This includes building new websites, supporting workshops and conferences, proceedings, etc. They produce deliverables, such as web content, using existing tools and infrastructure."}
{"typeID":0,"typeDesc":"","typeText":""}
